//百钱百鸡 公鸡5块 母鸡3块 小鸡 1块3只 一百块买一百只鸡 公鸡母鸡小鸡个多少只
var num = 100;

for (var i = 1; i < 100; i++) {
    var a = 5 * i;
    for (var j = 1; j < 100; j++) {
        var b = 3 * j;
        //如果需要用后面的方法， 从这里把后面的if判定注释掉， 然后放出for循环的语句
        var c = 100 - a - b; //多少钱 还剩多少钱给买小鸡
        if (i + j + c * 3 == 100) {
            console.log("公鸡:" + i + "只," + "一共要" + a + "块钱");
            console.log("母鸡:" + j + "只," + "一共要" + b + "块钱");
            console.log("小鸡:" + c * 3 + "只," + "一共要" + c + "块钱");
            console.log("--------分割线--------");
        }

        // for (var k = 1; k < 100; k++) {
        //     var c = k / 3;
        //     if (a + b + c == 100 && i + j + k == 100) {
        //         console.log("公鸡:" + i + "只," + "一共要" + a + "块钱");
        //         console.log("母鸡:" + j + "只," + "一共要" + b + "块钱");
        //         console.log("小鸡:" + k + "只," + "一共要" + c + "块钱");
        //         console.log("--------分割线--------");
        //     }
        // }

    }
}