//ES6 允许按照一定模式，从数组和对象中提取值，对变量进行赋值，
//也就是按照相同的结构对应给值，这被称为解构

//let [a, b] = [2, 3];
//console.log(a, b) //2  3

//let [c, d, e] = [2, 3]
//console.log(c, d, e); //2  3   undefined

//如果等号的右边不是数组将会报错
// let [f] = 1;
// let [g] = {};   

//使用 ...扩展运算符拆分

//let a = [1, 2, 3];
//console.log([...a]); //输出[1,2,3]

//let [b, c, ...d] = [1, 2, 3, 4, 5, 6]
//console.log(b, c, d); //1  2   [3,4,5,6]

//字符串等 在数组的解构中，解构的目标若为可遍历对象，皆课进行解构赋值
//let [x, y, z] = "zoo";
//console.log(x, y, z) //'z' 'o'  'o'

//解构默认值
let { a = 10, b = 5 } = { a: 3 };
//a = 3; b = 5;
let { a: aa = 10, b: bb = 5 } = { a: 3 };
//aa = 3; bb = 5;